
export const ZodiacPlanet = [
  "太阳",
  "月亮",
  "水星",
  "金星",
  "火星",
  "木星",
  "土星",
  "天王",
  "海王",
  "冥王",
  "南交",
  "北交"
]

export const ZodiacSigns = [
  "白羊",
  "金牛",
  "双子",
  "巨蟹",
  "狮子",
  "处女",
  "天秤",
  "天蝎",
  "射手",
  "摩羯",
  "水瓶",
  "双鱼"
]

export const ZodiacHouse = [
  "1宫",
  "2宫",
  "3宫",
  "4宫",
  "5宫",
  "6宫",
  "7宫",
  "8宫",
  "9宫",
  "10宫",
  "11宫",
  "12宫"
]

export const ZodiacPlanetDetail = {
  "太阳": "太阳守护狮子座，代表个性、人生目标、价值、外在形象、表现形式、权力、生命力、地位。 ",
  "月亮": "守护巨蟹座，代表情绪、内心世界、与过去或前世的关联、母亲。 ",
  "水星": "守护双子座和处女座，代表思想、思维、沟通、交流。 ",
  "金星": "守护金牛座和天秤座，代表爱情、美、享乐、金钱、社交、艺术。 ",
  "火星": "守护白羊座和天蝎座，代表行动力、占有欲的表现形式、努力的焦点、攻击、作战、冲动、勇气、精力充沛。 ",
  "木星": "守护射手座和双鱼座，主宰人的“福气”、精神生活状况、旅行、哲学、宗教、法律、教育。 ",
  "土星": "守护摩羯座和水瓶座，代表限制、困难、阻力、人的受损方式、教训、坚忍、毅力、重视经验、踏实。 ",
  "天王": "守护水瓶座，代表改变、象征解开过去迈向未来、科技、革命、反传统、特立独行、与众不同的能力。 ",
  "海王": "守护双鱼座，象征梦幻、想象力、浪漫、朦胧、迷茫、敏感、迷药、药物、嗜好、自我牺牲、同情心。 ",
  "冥王": "守护天蝎座，代表重生、神秘部分、深沉、不为人知、天赋、坚强意志力、虐性、残酷。",
  "南交": "和过去的人事物有关的、不顺利、念旧的。 ",
  "北交": "展望未来、顺利。 "
}

export const ZodiacSignsDetail = {
  "白羊": "冲动、勇敢、激情、吸引力、行动力、本能、斗志、自我、怒气、对立、冲突、矛盾。 ",
  "金牛": "外表温顺，内心充满欲望、踏实、可靠、有耐性、安逸、享乐、木讷、固执、被动、爱吃、肉欲、懒惰、物质。 ",
  "双子": "二元性、思考、沟通、交流、好奇心、灵活、善变、内外矛盾、多元化、玩乐、变动、三心二意、广而浅。 ",
  "巨蟹": "家庭、母性、情绪化、念旧、旧人、过去、多愁善感、亲密关系、亲切感、温暖、依赖、保护隐藏、敏感。 ",
  "狮子": "高贵、王者之风、热情、发光体、虚荣心、爱现、追求、目标、勇敢、善战、霸道、强势、自尊心强。 ",
  "处女": "理性、务实、客观、收成、聪颖、敏锐、服务、付出、负责、细心、小心、谨慎、沉静、羞怯、追求完美、善于分析思考。 ",
  "天秤": "公平、平衡、优雅、有礼、艺术、社交、美、浪漫、爱情、摇摆不定、犹豫不决、选择困难、权衡。 ",
  "天蝎": "毁灭、重生、欲望、隐藏、神秘、第六感、潜意识、洞察力、深沉、顽强意志力、忌妒、记仇。 ",
  "射手": "智慧、远行、旅行、外国人、轻松、愉快、自由、坦率、冒险、教育、高傲、自负。 ",
  "摩羯": "担心、恐惧、努力、耐心、持久、负责、严谨、缓慢、困难、功利、现实、冷漠。 ",
  "水瓶": "个人主义、爱好自由、高度知性、不可预测、特立独行、友善、创新创意、转折、改变、叛逆、突发、分离、疏离。 ",
  "双鱼": "二元性、浪漫、幻想、牺牲、同情、逃避、矛盾、复杂、迷茫、暧昧、落空、悲观、失望、敏感、堕落。 "
}

export const ZodiacHouseDetail = {
  "1宫": "自己、命运、生命力、自我意识、外貌、人格。 ",
  "2宫": "价值观、理财能力、个人资产、财富方式。 ",
  "3宫": "兄弟姐妹、左邻右舍、智慧、语言与文字能力。 ",
  "4宫": "家庭、生活环境、家世、前世、根、家居生活、房地产、父亲。 ",
  "5宫": "子女、恋爱运、娱乐、偏财运、表现力、休闲活动、赌博。 ",
  "6宫": "健康运、工作运、个人的责任、社会服务、宠物。 ",
  "7宫": "婚姻、伴侣、合伙关系、密友、公开的敌人、法律、诉讼。 ",
  "8宫": "共有的资源、他人或配偶的钱、遗产、性、死亡、意外、保险。 ",
  "9宫": "长途旅行、国外、高等教育、哲学、宗教道德。 ",
  "10宫": "社会地位、名誉荣誉、外在形象、人生顶点、事业成就、社会责任、母亲。 ",
  "11宫": "朋友、社团、共同嗜好、志同道合、友谊。 ",
  "12宫": "精神面、隐秘面、秘密、潜意识、个人隐私、牺牲、秘密。 "
}


export const ZodiacPlanetWatchHouse = {
  "太阳": ["狮子"],
  "月亮": ["巨蟹"],
  "水星": ["双子", "处女"],
  "金星": ["金牛", "天秤"],
  "火星": ["白羊", "天蝎"],
  "木星": ["射手", "双鱼"],
  "土星": ["摩羯", "水瓶"],
  "天王": ["水瓶"],
  "海王": ["双鱼"],
  "冥王": ["天蝎"],
  "南交": [],
  "北交": []
}

const i_111111 = `乾卦
[卦辞]
乾。元，亨，利，贞。
象曰：天行健，君子以自强不息。

乾卦：大吉大利，吉利的贞卜。
《象辞》说：天道刚健，运行不已。君子观此卦象，从而以天为法，自强不息。

[爻辞]
- 初九。潜龙勿用。
  象曰：潜龙勿用，阳在下也。
  初九：潜藏的龙，无法施展。
  《象辞》说：潜藏的龙，无法施展，因为初九阳爻处在一卦的下位，所以压抑难伸。

- 九二。见龙在田，利见大人。
  象曰：见龙在田，德施普也。
  九二：龙出现在大地上，有利于会见贵族王公。
  《象辞》说：龙出现在大地上，喻指君子走出了压抑的低谷，正开始谋取能够广泛施予德泽的社会地位。

- 九三。君子终日乾乾，夕惕若；厉，无咎。
  象曰：终日乾乾，反复道也。
  九三：有才德的君子始终是白天勤奋努力，夜晚戒惧反省，虽然处境艰难，但终究没有灾难。
  《象辞》说：君子整日里勤奋努力，意思是反复行道，坚持不舍。

- 九四。或跃在渊，无咎。
  象曰：或跃在渊，进无咎也。
  九四：龙也许跳进深潭，没有灾难。
  《象辞》说：龙也许跳进深潭，表示可以有所作为而没有灾难。

- 九五。飞龙在天，利见大人。
  象曰：飞龙在天，大人造也。
  九五：龙飞腾在空中，有利于会见贵族王公。
  《象辞》说：龙飞腾在空中，意味着君子大有所为。

- 上九。亢龙有悔。
  象曰：亢龙有悔，盈不可久也。
  上九：升腾到极限的龙会有灾祸之困。
  《象辞》说：升腾到极限的龙会有灾祸之困，这是警戒人们崇高、盈满是不可能长久保持的。`

const i_111011 = `履卦
[卦辞]
履。履虎尾，不咥人，亨。
象曰：上天下泽，履。君子以辨上下，定民志。

履卦：踩着虎尾巴，老虎不咬人，吉利。
《象辞》说：本卦上卦为乾，为天，下卦为兑，为泽，上天下泽，尊卑显别，这是履卦的卦象。君子观此卦象，从而分别上下尊卑，使人民循规蹈矩，安份守纪。

[爻辞]
- 初九。素履，往无咎。
  象曰：素履之往，独行愿也。
  初九：以朴素坦白的态度处世，没有灾害。
  《象辞》说：以朴素坦白的态度处世，是说能独行其志愿。

- 九二。履道坦坦，幽人贞吉。
  象曰：幽人贞吉，中不自乱也。
  九二：行道之人，胸怀坦荡；隐居之人，长逢吉兆。
  《象辞》说：隐居之人洁身守正，因为他们秉性中正，不被世俗所惑。

- 六三。眇能视，跛能履。履虎尾，咥人，凶。武人为于大君。
  象曰：眇能视，不足以有明也。跛能履，不足以与行也。咥人之凶，位不当也。武人为于大君，志刚也。
  六三：瞎了眼睛却要看物，跛了脚却要行走，这是勉为其难，犹如踩着虎尾巴，终将为虎所伤。这是凶险之事。武人纂夺国政，同样是凶险之事。
  《象辞》说：瞎了眼睛却要看物，其视力不足以辨物。跛了脚却要行走，其脚力不足以行路。老虎之所以伤人，因为六三阴爻而居于阳位，所处不当。武人纂夺国政，这是僭越犯上，以六三之位而行九五之志，必遭祸殃。

- 九四。履虎尾，愬愬，终吉。
  象曰：愬愬终吉，志行也。
  九四：踩着虎尾巴，但能遇险知惧，最后仍吉利。
  《象辞》说：恐惧警惕，终归于吉，说明虽历磨难，但志愿得行。

- 九五。夬履，贞厉。
  象曰：夬履贞厉。位正当也。
  九五：行为急躁莽撞；卜其行事有危险之象。
  《象辞》说：行为急躁莽撞，卜其行事有危险之象，但九五阳爻居上卦中位，正当其位。因而虽险不凶。

- 上九。视履考祥，其旋元吉。
  象曰：元吉在上，大有庆也。
  上九：行为审慎，遇事周密反复地考虑，大吉。
  《象辞》说：大吉大利，因为上九之爻居全卦之首。预兆其人将有重大喜庆之事。`

const i_111101 = `同人卦
[卦辞]
同人。同人于野，亨。利涉大川，利君子贞。
象曰：天与火，同人；君子以类族辨物。

同人卦：聚众于郊外，将行大事，吉利。有利于涉水渡河，有利于君子的卜问。
《象辞》说：同人之卦，上卦为乾为天为君王，下卦为离为火为臣民，上乾下离象征君王上情下达，臣民下情上达，君臣意志和同，这是同人的卦象。君子观此卦象，取法于火，明烛天地，照亮幽隐，从而去分析物类，辨明情状。

[爻辞]
- 初九。同人于门，无咎。
  象曰：出门同人，又谁咎也。
  初九：聚集大众于王门，将行大事，没有灾祸。
  《象辞》说：君王走出王门与国人打成一片，谁又会遭受灾祸呢？

- 六二。同人于宗，吝。
  象曰：同人于宗，吝道也。
  六二：聚同族于宗庙，卜祷凶吉，因为面临艰难。
  《象辞》说：仅仅聚同族于宗庙，这是狭隘的宗法原则。

- 九三。伏戎于莽，升其高陵，三岁不兴。
  象曰：伏戎于莽，敌刚也，三岁不兴，安行也。
 九三：将军队隐蔽在深山密林，并且占领了制高点，但长时期不能取胜。
 《象辞》说：将军队隐蔽在深山密林，因为敌人太强大。长时期不能取胜，怎能有所作为呢？

- 九四。乘其墉，弗克攻，吉。
  象曰：乘其墉，义弗克也，其吉，则困而反则也。
  九四：爬上了敌人的城墙，城还没有攻下来，继续攻打才能获胜。
  《象辞》说：爬上了敌人的城墙，从道义上讲应该停士攻城。之所以继续攻打为吉利，因为困守之敌可能逞其狡诈。

- 九五。同人，先号啕而后笑，大师克相遇。
  象曰：同人之先，以中直也。大师相遇，言相克也。
  九五：聚集起来的大众先哭嚎后欢笑，因为大军及时增援，大获胜仗。
  《象辞》说：聚集起来的大众之所以先哭后笑（战斗转败为胜），因为筮遇此爻，九五居上卦之中位，像人得贞正之道，势必化凶为吉。大军会师，是说我军压倒了敌人。

- 上九。同人于郊，无悔。
  象曰：同人于郊，志未得也。
  上九：聚众于郊外，致祭于神灵祝贺胜利，自然没有悔咎。
  《象辞》说：聚众于郊外，援助不广，尚不得行其志。`

const i_111001 = `无妄卦
[卦辞]
无妄。元，亨，利，贞。其匪正有眚，不利有攸往。
象曰：天下雷行，物与无妄。先王以茂对时，育万物。

无妄卦：嘉美通泰，卜问得吉兆。行为不正当，则有灾殃，有所往则不利。
《象辞》说：本卦上卦为乾为天，下卦为震为雷，天宇之下，春雷滚动，万物萌发，孳生繁衍，这是无妄的卦象。先王观此卦象，从而奋勉努力，顺应时令，保育万物。

[爻辞]
- 初九。无妄，往吉。
  象曰：无妄之往，得志也。
  初九：不要妄行非正，吉利。
  《象辞》说：没有悖妄的行为，因为所有行动受到意志的控制。

- 六二。不耕获，不菑畲，则利有攸往。
  象曰：不耕获，未富也。
  六二：不耕种就想收获，不开荒地就想种熟地。这些妄谬的行径怎能有利?
  《象辞》说：不耕种而想收获，这种空妄的念头不能带来财富。

- 六三。无妄之灾。或系之牛，行人之得，邑人之灾。
  象曰：行人得牛，邑人灾也。
  六三：意外的灾难。比喻说有人将牛系在不该系的地方，行人顺手牵牛获意外之得，邑人失牛受到意外之灾。
  《象辞》说：行人意外得牛，邑人意外蒙灾。

- 九四。可贞，无咎。
  象曰：可贞无咎，固有之也。
  九四：称心的占问，没有灾难。
  《象辞》说：具有贞正的品德，没有灾难，理应如此。

- 九五。无妄之疾，勿药有喜。
  象曰：无妄之药，不可试也。
  九五：患意外之病，不要忙乱服药，自可痊愈。
  《象辞》说：出人意外的药物，不可随便服用。

- 上九。无妄，行有眚，无攸利。
  象曰：无妄之行，穷之灾也。
  上九：不要胡作妄行！将有灾殃，没有好处。
  《象辞》说：谬妄的行为，是绝望无聊的表现。`

const i_111110 = `姤卦
[卦辞]
姤。女壮，勿用取女。
象曰：天下有风，姤。后以施命诰四方。

姤卦：梦见女子受伤。筮遇此卦，不利于娶女。
《象辞》说：本卦上卦为乾，乾为天；下卦为巽，巽为风，可见天下有风，是姤卦的卦象，君王观此卦象，从而效法于风之吹拂万物，施教化于天下，昭告四方。

[爻辞]
- 初六。系于金柅，贞吉。有攸往，见凶。羸豕孚蹢躅。
  象曰：系于金柅，柔道牵也。
  初六：细柔之线牵附于黄铜柅子之上。这是吉利的贞兆。若占问有所往，则必逢凶险，就象瘦弱的猪被不情愿地拖回来。
  《象辞》说：细柔之线牵附于黄铜柅子上，是说柔物被牵制于刚物，以像柔弱者依附于刚强者，则获吉利。

- 九二。包有鱼，无咎，不利宾。
  象曰：包有鱼，义不及宾也。
  九二：厨中有鱼。占得此爻，没有灾祸，但不利宴请宾客。
  《象辞》说：厨中有鱼，有鱼无肉，乃小康之象，不宜大肆宴请宾客。

- 九三。臀无肤，其行次且。厉，无大咎。
  象曰：其行次且，行未牵也。
  九三：臀部负伤，行走困难。占得此爻，有危险，但尚无大的灾难。
  《象辞》说：行走困难，因为没有人扶持。

- 九四。包无鱼，起凶。
  象曰：无鱼之凶，远民也。
  九四：厨中无鱼。筮遇此爻，有所动作必遭凶险。
  《象辞》说：厨中无鱼之爻，显示其人必遭凶险。因为九四阳爻而居阴位，像君王失其权位，脱离民众。

- 九五。以杞包瓜，含章，有陨自天。
  象曰：九五含章，中正也；有陨自天，志不舍命也。
  九五：匏瓜缠着杞树生长，隐印的瓜纹很好看。忽然从头顶上方掉下一个瓜来。
  《象辞》说：九五爻辞讲的隐含文彩，即指九五之爻居上卦中位，像人秉含中正之德。自天上殒落，说明高尚的志行不得施行，故舍命而殉志。

- 上九。姤其角，吝，无咎。
  象曰：姤其角，上穷吝也。
  上九：遭遇野兽，处于它的角锋之下，不是好兆头，但没有大的灾难。
  《象辞》说：遭遇野兽，处于它的角锋之下，因为上九阳爻居一卦之尽头，像人处于穷困之境地。`

const i_111010 = `讼卦
[卦辞]
讼。有孚，窒惕，中吉，终凶。利见大人，不利涉大川。
象曰：天与水违行，讼。君子以做事谋始。

讼卦：虽有利可图(获得俘虏)，但要警惕戒惧。其事中间吉利，后来凶险。占筮得此爻，有利于会见贵族王公，不利于涉水渡河。
《象辞》说：上卦为乾，乾为天；下卦为坎，坎为水，天水隔绝，流向相背，事理乖舛，这是讼卦的卦象。君子观此卦象，以杜绝争讼为意，从而在谋事之初必须慎之又慎。

[爻辞]
- 初六。不永所事，小有言，终吉。
  象曰：不永所事，讼不可长也；虽小有言，其辩明也。
  初六：做事不能持之以恒，稍有过错，最后还是吉利的。
  《象辞》说：做事不能持之以恒，说明官司不可能长久打下去。虽然稍有过错，但争讼双方的是非曲直终将辨别清楚。

- 九二。不克讼，归而逋，其邑人三百户无眚。
  象曰：不克讼，归而逋也；自下讼上，患至掇也。
  九二：讼事失败，归到采邑，三百户奴隶逃亡。没有大的灾祸。
  《象辞》说：讼事失败，逃窜回家，这是躲避反讼。小官与大官争讼，败讼而归，势在必然。幸好灾难没有进一步扩大。

- 六三。食旧德，贞厉，终吉。或从王事，无成。
  象曰：食旧德，从上吉也。
  六三：依赖先人遗业过活。卜问得险兆，但最后是吉利的。但是，如果服务于王事，谋取利禄，却不会成功。
  《象辞》说：依赖先人遗业过活，因为六三爻象表明，居于九四之下，只有凭借祖上余荫才获吉利。

- 九四。不克讼，复即命，渝安贞，吉。
  象曰：复即命，渝安贞，吉，不失也。
  九四：讼事失败，败讼回家，服从判决。卜问平安，得吉利之兆。
  《象辞》说：败讼回家，服从判决，安守本分，不失正道。

- 九五。讼，元吉。
  象曰：讼，元吉，以中正也。
  九五：争讼，筮遇此爻，大吉大利。
  《象辞》说：争讼而大吉大利，因为九五之爻居上卦的中位，像人守中正之道。

- 上九。或锡之鞶带，终朝三褫之。
  象曰：以讼受服，亦不足敬也。
  上九：王侯赐予人以绅带，但不满一天，三次赐予三次革夺。
  《象辞》说：某人因为讼事而得到赐予绅带的殊荣，这不是值得尊敬的事。`

const i_111100 = `遁卦
[卦辞]
遁。亨。小利贞。
象曰：天下有山，遁。君子以远小人，不恶而严。

遁卦：通达。小有利之占问。
《象辞》说：本卦上卦为乾，乾为天，下卦为艮，艮为山，天下有山，天高山远，是遁卦的卦象。君子观此卦象，从而不用以恶报恶的方法对付小人，而是采取严厉的态度，挂冠悬笏，自甘退隐，远离小人。


[爻辞]
- 初六。遁尾，厉。勿用有攸往。
  象曰：遁尾之厉，不往何灾也。
  初六：君子全部隐退，国家就危险了。不能有所作为了。
  《象辞》说：逃遁隐藏仍未脱离危险，若能坚持苦斗，设法取胜，有什么灾难？

- 六二。执之用黄牛之革，莫之胜说。
  象曰：执用黄牛，固志也。
  六二：抓来用黄牛革绳紧紧捆绑，这样就不能解脱了。
  《象辞》说：用黄牛革绳捆绑，表示意志坚固。

- 九三。系遁，有疾厉。畜臣妾，吉。
  象曰：系遁之厉，有疾惫也。畜臣妾吉，不可大事也。
  九三：被拖累而不能决然隐退，就像身染重病，情形危险。在这种情况下，蓄养奴婢或可有利。
  《象辞》说：被拖累以至不能决然隐退所造成的危险，有如被疾病折腾得疲惫不堪，所以说蓄养奴婢则吉，意思是暂且养疾疗伤，不可贸然行动。

- 九四。好遁，君子吉，小人否。
  象曰：君子好遁，小人否也。
  九四：喜爱隐居，这对君子是吉利的，对小人则未必。
  《象辞》说：君子不以利禄为心，喜爱隐居；小人以利禄为心，不甘退隐。

- 九五。嘉遁，贞吉。
  象曰：嘉遁贞吉，以正志也。
  九五：退隐以时，值得赞美，卜问前程，通泰吉利。
  《象辞》说：退隐以时，值得赞美；遵循正道，所以吉利，因为他存心正直，品德崇高。

- 上九。肥遁，无不利。
  象曰：肥遁无不利，无所疑也。
  上九：远走高飞，退隐山林，无不利。
  《象辞》说：上九爻辞讲远走高飞，退隐山林，无不利，说明其人善观形势，急流勇退。
`

const i_111000 = `否卦
[卦辞]
否。否之匪人。不利君子贞。大往小来。
象曰：天地不交，否。君子以俭德辟难，不可荣以禄。

否卦：为小人所隔阂，这是不利于君子的占卜，事业也将由盛转衰。
《象辞》说：天地隔阂不能交感，万物咽窒不能畅釜，这是否卦的卦象。君子观此卦象，从而在国家政治否塞之时，应思隐居不仕，以崇尚俭约来躲避灾难，不要以利禄为荣。

[爻辞]
- 初六。拔茅茹，以其汇，贞吉，亨。
  象曰：拔茅贞吉，志在君也。
  初六：连根拔掉茅草，及其同类，占得此爻则吉利，亨通。
  《象辞》说：连根拔掉茅草，占得此爻吉利，比喻其志在清理君侧，为国尽忠。

- 六二。包承，小人吉；大人否，亨。
  象曰：大人否，享，不乱群也。
  六二：厨中有肉，这对老百姓来说是吉利，对贵族来说并不是通泰的表现。
  《象辞》说：贵族身处窘境，则能心怀惩戒，使其安守本分。

- 六三。包羞。
  象曰：包羞，位不当也。
  六三：厨中有美味。
  《象辞》说：心怀羞愧，因为才德不称其位。

- 九四。有命无咎，畴离祉。
  象曰：有命无咎，志行也。
  九四：君王有赏赐之命，没有灾害，谁能得到赏赐呢?
  《象辞》说：君王有赏赐之命，没有灾害，说明君王论功行赏，臣下尽职效力，各行其志。

- 九五。休否，大人吉；其亡其亡，系于苞桑。
  象曰：大人之吉，位正当也。
  九五：警戒覆亡，贵族王公如此存心则吉利。危险呵，危险，国家命运好像系在柔弱的苞草、桑枝上一样。
  《象辞》说：九五爻辞讲贵族王公安不忘危，则吉利。因为九五之爻居上卦中位，像其人忧国忧君，才德正当其位。

- 上九。倾否，先否后喜。
  象曰：否终则倾，何可长也。
  上九：短暂的恶运，先遇恶运后交好运。
  《象辞》说：恶运快终了，好运岂迢遥。命运交变之际，什么力量可以制止呢？`

const i_011111 = `夬卦
[卦辞]
夬。扬于王庭，孚号，有厉。告自邑，不利即戎，利有攸往。
象曰：泽上于天，夬。君子以施禄及下，居德则忌。

夬卦：王庭里正跳舞作乐。有人呼告：“有敌人来犯。”邑中传来命令：“出击不利，要严阵以待。”筮遇此爻，出外旅行则吉利。
《象辞》说：本卦上卦为兑，兑为泽；下卦为乾，乾为天，可见泽水上涨，浇灌大地，是夬卦的卦象。君子观此卦象，从而泽惠下施，不敢居功自傲，并以此为忌。

[爻辞]
- 初九。壮于前趾，往不胜为咎。
  象曰：不胜而往，咎也。
  初九：脚趾受伤，仍然继续前进，将因为脚力不胜而遭致灾难。
  《象辞》说：脚力不胜而继续行进，将遭灾难。

- 九二。惕号，莫夜有戎，勿恤。
  象曰：有戎勿恤，得中道也。
  九二：恐惧地惊叫，夜间有敌来犯，但不足为患。
  《象辞》说：有敌来犯，不足为患，因为九二之爻居下卦中位，像人得中正之道。

- 九三。壮于頄，有凶。君子夬夬，独行遇雨，若濡有愠，无咎。
  象曰：君子夬夬，终无咎也。
  九三：颧骨受伤，这是凶象。君子匆匆忙忙地独个儿行路，碰上了雨，全身淋湿了，令人很不快，但没有灾难。
  《象辞》说：君子匆匆忙忙地独个儿行路，但最后没有灾难。

- 九四。臀无肤，其行次且。牵羊悔亡，闻言不信。
  象曰：其行次且，位不当也；闻言不信，聪不明也。
  九四：臀部受伤，走起路来踉踉跄跄。牵羊上路，悔恨丢失了羊儿，这是由于对别人的告诫不相信。
  《象辞》说：行路艰难，因为九四阳爻而居阴位，像人处境不利。对于别人的告诫不相信，说明听觉虽好，但不明事理。

- 九五。苋陆夬夬，中行无咎。
  象曰：中行无咎，中未光也。
  九五：细角山羊在道路中间蹦蹦跳跳，筮遇此爻无灾难。
  《象辞》说：行中正之道，仅称无灾难，大概是没有将中行之道推广施行。

- 上六。无号，终有凶。
  象曰：无号之凶，终不可长也。
  上六：狗在哭叫，预兆着终将有凶险之事。
  《象辞》说：国无号令，其势必遭凶险，说明国运衰微，终不可保。`

const i_011011 = `兑卦
[卦辞]
兑。亨，利，贞。
象曰：丽泽，兑。君子以朋友讲习。
兑卦：亨通。吉利的贞卜。
《象辞》说：本卦为两兑相叠，兑为泽，两泽相连，两水交流是兑卦的卦象。君子观此卦象，从而广交朋友，讲习探索，推广见闻。

[爻辞]
- 初九。和兑，吉。
  象曰：和兑之吉，行未疑也。
  初九：和睦欢喜，吉利。
  《象辞》说：和睦欢喜之所以吉利，因为人际邦交无所猜疑。

- 九二。孚兑，吉，悔亡。
  象曰：孚兑之吉，信志也。
  九二：优待俘虏，吉利，没有悔恨。
  《象辞》说：以诚信待人，人亦热忱待之，之所以吉利，因为互相之间有了信任。

- 六三。来兑，凶。
  象曰：来兑之凶，位不当也
  六三：以使人归服为乐，蕴藏着凶险。
  《象辞》说：以使人归服为乐，蕴藏着凶险，因为力小而任大，德薄而欲多，所行必不当。

- 九四。商兑，未宁，介疾有喜。
  象曰：九四之喜，有庆也。
  九四：商谈恢复邦交之事，尚未达成协议，但两国的矛盾分歧有了愈合的趋势。
  《象辞》说：九四爻辞所讲的喜，即是指将有喜庆之事。

- 九五。孚于剥，有厉。
  象曰：孚于剥，位正当也。
  九五：被剥国俘虏。剥国无理挑衅，必遭惩罚（对我方而言，坏事将变为好事）。
  《象辞》说：当被侵剥之时，仍以诚信待人，正如九五阳爻所象，其人秉行中正之道，必能逢凶化吉。

- 上六。引兑。
  象曰：上六引兑，未光也。
  上六：引导大家和睦相处。
  《象辞》说：上六爻辞讲引导大家和睦相处，用意虽佳，但上六阴爻处一卦之尽头，像其人未必能一呼百应。`

const i_011101 = `革卦
[卦辞]
革。己日乃孚。元亨利贞。悔亡。
象曰：泽中有火，革。君子以治历明时。
革卦：祭祀之日用俘虏作人牲，亨通，吉利的卜问。没有悔恨。
《象辞》说：本卦外卦为兑，兑为泽；内卦为离，离为火。内蒸外煏，水涸草枯，如同水泽之中，大火燃烧，这是革卦的卦象。君子观此卦象，了解到泽水涨落，草木枯荣的周期变化，从而修治历法，明确时令。

[爻辞]
- 初九。巩用黄牛之革。
  象曰：巩用黄牛，不可以有为也。
  初九：用黄牛的皮革束紧加固(战车)。
  《象辞》说：用黄牛的皮革束紧加固，说明其人被紧紧束缚不能有作为。

- 六二。己日乃革之。征吉，无咎。
  象曰：己日革之，行有嘉也。
  六二：祭祀的日期要改变。随之要重新卜问征战的日期，结果卜得吉兆，没有灾难。
  《象辞》说：祭祀的日期要改变，大概是因为将有喜庆之事。

- 九三。征凶，贞厉。革言三就，有孚。
  象曰：革言三就，又何之矣。
  九三：出征，吃了败仗，卜问得凶兆。但是，只要振奋精神，整顿装备，重新开战，则能转败为胜，生擒强敌。
  《象辞》说：犯人屡次推翻供辞，只得反复进行审讯，这说明抵赖无用，只能招出实情。

- 九四。悔亡，有孚，改命，吉。
  象曰：改命之吉，信志也。
  九四：没有悔恨。至于占问战争，则小有战果，如果改帅易将，则将大吉。
  《象辞》说：九四爻辞讲改帅易将之所以吉利，因为这样能使有才德的人施展抱负。

- 九五。大人虎变，未占有孚。
  象曰：大人虎变，其文炳也。
  九五：王公大人赫然斯怒，化柔弱为威猛，不用卜占，即知将大获胜仗。
  《象辞》说：王公赫然斯怒，威猛如虎，说明其人仪表威严，光采照人。

- 上六。君子豹变，小人革面。征凶，居贞吉。
  象曰：君子豹变，其文蔚也。小人革面，顺以从君也。
  上六：君子精神振奋，但基层官兵一反常态。筮遇此爻，占问征伐，则凶险。卜问居处则吉利。
  《象辞》说：君子精神振奋，说明其仪态清朗雍容。小人洗心革面，说明小人去恶从善，服从君上。`

const i_011001 = `随卦
[卦辞]
随。元亨，利贞，无咎。
象曰：泽中有雷，随。君子以向晦入宴息。
随卦：大吉大利，卜得吉兆，没有灾害。
《象辞》说：本卦下卦为震，震为雷，上卦为兑，兑为泽；雷入泽中，大地寒凝，万物蛰伏，是随卦的卦象。君子观此卦象，取法于随天时而沉寂的雷声，随时作息，向晚则入室休息。

[爻辞]
- 初九。官有渝，贞吉。 出门交有功。
  象曰：官有渝，从正吉也；出门交有功，不失也。
  初九：馆舍时里发生事故，筮遇此爻则吉，出门同行都得好处。
  《象辞》说：官吏把事情办坏了，归从正道则吉利。出门同行都得好处，这是不失正道的缘故。

- 六二。系小子，失丈夫。
  象曰：系小子，弗兼与也。
  六二：抓住了未成年的奴隶，跑了成年的奴隶。
  《象辞》说：抓住了小的，跑了大的，意思是两者不能兼得。

- 六三。系丈夫，失小子。随有求得，利居贞。
  象曰：系丈夫，志舍下也。
  六三：抓住了成年奴隶，跑了未成年奴隶。希望无失不如现得。筮遇此爻，卜问居处则吉利。
  《象辞》说：抓了大的，跑了小的，其志在于追逐大的，舍弃小的。

- 九四。随有获，贞凶。有孚在道，以明，何咎。
  象曰：随有获，其义凶也。有孚在道，明功也。
  九四：追名逐利，贪多务获，卜问得凶兆。押送俘虏上路，明于约束，没有灾难。
  《象辞》说：追名逐利，贪多务获，这种人遭遇凶险是应该的。谨守信用，严守正道，这是明察事功的结果。

- 九五。孚于嘉，吉。
  象曰：孚于嘉吉，位正中也。
  九五：俘虏了不少嘉人，吉利。
  《象辞》说：信守中正之道，诸事吉利，因为九五之爻居上卦中位，像人守中正之道。

- 上六。拘系之，乃从维之。王用亨于西山。
  象曰：拘系之，上穷也。
  上六：将俘虏拘禁起来，紧紧捆绑，周文王将他们作为人牲在西山祭祀神灵。
  《象辞》说：被捆绑拘禁，因为上六居一卦之尽头，像人处于穷困之境地。`

const i_011110 = `大过卦
[卦辞]
大过。栋桡。利有攸往，亨。\n\
象曰：泽灭木，大过。君子以独立不惧，遁世无闷。

大过卦：屋粱压得弯曲了。有所往则有利，通泰。
《象辞》说：本卦上卦为兑为泽，下卦为巽为木，上兑下巽，泽水淹没木舟，这是大过的卦象。君子观此卦象，以舟重则覆为戒，领悟到遭逢祸变，应守节不屈，稳居不仕，清静淡泊。

[爻辞]
- 初六。藉用白茅，无咎。
  象曰：藉用白茅，柔在下也。
  初六：恭敬地用白茅垫着祭品，可以无灾祸。
  《象辞》说：“恭敬地用白茅垫着祭品”，柔软之物铺垫在下面，正像初六阴爻居一卦之下位。

- 九二。枯杨生稊，老夫得其女妻，无不利。
  象曰：老夫女妻，过以相与也。
  九二：枯杨发芽，老头子娶少女为妻，并无不吉利。
  《象辞》说：夫老妻少，年龄不当，这是错误的婚配。

- 九三。栋桡，凶。
  象曰：栋桡之凶，不可以有辅也。
  九三：屋梁弯曲，这是凶险之象。
  《象辞》说：屋梁弯曲之所以凶险，因为栋曲即屋倾，无法支撑。

- 九四。栋隆，吉。有它吝。
  象曰：栋隆之吉，不桡乎下也。
  九四：屋梁挺直，吉利。但有意外之患则不好应付。
  《象辞》说：屋梁挺直之所以吉利，因为屋梁不弯曲则房屋不倾倒。

- 九五。枯杨生花，老妇得其士夫，无咎无誉。
  象曰：枯杨生花，何可久也。老妇土夫，亦可丑也。
  九五：枯杨开花，老妇人嫁给一个年轻人，这件事不好也不坏。
  《象辞》说：枯杨开花，其花怎能长开不谢。老妇人嫁给年轻人，这种事总不大光彩。

- 上六。过涉灭顶，凶，无咎。
  象曰：过涉之凶，不可咎也。
  上六：盲目涉水，水深过顶，虽遇凶险，但终归没有灾难。
  《象辞》说：盲目涉水遭致危险，事已至此，谴责亦属无益。`

const i_011010 = '困卦\n\
困。亨，贞，大人吉，无咎。有言不信。\n\
象曰：泽无水，困。君子以致命遂志。'

const i_011100 = '咸卦\n\
咸。亨，利贞。取女吉。\n\
象曰：山上有泽，咸。君子以虚受人。'

const i_011000 = '萃卦\n\
萃。亨，王假有庙。利见大人，亨，利贞。用大牲吉。利有攸往。\n\
象曰：泽上于地，萃。君子以除戎器，戒不虞。'

const i_101111 = `大有卦
[卦辞]
大有。元亨。\n\
象曰：火在天上，大有。君子以遏恶扬善，顺天休命。

大有卦：昌隆通泰。
《象辞》说：本卦下卦为乾为天，上卦为离为火，火在天上，明烛四方，这是大有的卦象。君子观此卦象，取法于火，洞察善恶，抑恶扬善，从而顺应天命，祈获好运。

[爻辞]
- 初九。无交害，匪咎；艰则无咎。
  象曰：大有初九，无交害也。
  初九：不要彼此侵害，即没有灾祸，既使处于艰难之中，也没有灾祸。
  《象辞》说：大有初九爻辞说，不要彼此侵害。

- 九二。大车以载，有攸往，无咎。
  象曰：大车以载，积中不败也。
  九二：用大车装物载人，有明确的目的地，没有灾祸。
  《象辞》说：用大车装物载人，物积于车中不会散失。

- 九三。公用亨于天子，小人弗克。
  象曰：公用亨于天子，小人害也。
  九三：天子宴请公侯。小人则不能参与。
  《象辞》说：天子宴请公侯，（小人不能参与）因为小人参与国政，将是国家的祸害。

- 九四。匪其彭，无咎。
  象曰：匪其彭，无咎，明辩晰也。
  九四：用曝晒男巫来求雨，旱情严重，但没有灾祸。
  《象辞》说：反对坏人坏事没有灾祸，因为明于考察辨析。

- 六五。厥孚交如，威如，吉。
  象曰：厥孚交如，信以发志也；威如之吉，易而无备也。
  六五：来犯之敌被紧紧捆绑，严厉惩罚，吉利。
  《象辞》说：其人诚信坦白，因为他以诚信来表现自己的志向。威服众人之所以吉利，因为众人敬畏，则能平安而不困惫。

- 上九。自天祐之，吉无不利。
  象曰：大有上吉，自天祐也。
  上九：上天保祐，吉利，无所不顺利。
  《象辞》说：大有是大吉大利之卦，因为得到上天的保祐。`

const i_101011 = '睽卦\n\
睽。小事吉。\n\
象曰：上火下泽，睽。君子以同而异。'

const i_101101 = '离卦\n\
离。利贞，亨。畜牝牛，吉。\n\
象曰：明两作，离。大人以继明照四方。'

const i_101001 = '噬嗑卦\n\
噬嗑。亨。利用狱。\n\
象曰：雷电噬嗑。先王以明罚敕法。'

const i_101110 = `鼎卦
[卦辞]
鼎。元吉，亨。
象曰：木上有火，鼎。君子以正位凝命。

鼎卦：大吉大利，亨通。
《象辞》说：本卦下卦为巽，巽为木；上卦为离，离为火。可见木上有火，以鼎烹物，这是《鼎》卦的卦象。君子观此卦象，取法于鼎足三分，正立不倚，从而持正守位，为君上所倚重，不负使命。

[爻辞]
- 初六。鼎颠趾，利出否。得妾以其子，无咎。
  象曰：鼎颠趾，未悖也。利出否，以从贵也。
  初六：将鼎倾覆，鼎足向上，筮遇此爻，利于清除恶人。以无子而纳妾。因纳妾而得子，没有灾祸。
  《象辞》说：将鼎倾覆，这不是悖乱之举。清除朝中恶人，这是听从了上面的旨意。

- 九二。鼎有实，我仇有疾，不我能即，吉。
  象曰：鼎有实，慎所之也。我仇有疾，终无尤也。
  九二：鼎中有食物。筮遇此爻，家里有饭吃，仇家有疾病，再没有什么东西困扰我，吉利。
  《象辞》说：家里有饭吃，家境优裕，犹宜重其身家，慎其出处。仇家有疾病，我可以安亨清福，终于没有灾祸。

- 九三。鼎耳革，其行塞，雉膏不食。方雨，亏悔，终吉。
  象曰：鼎耳革，失其义也。
  九三：鼎耳脱落了。筮遇此爻，打猎无所获。野味莫吃光，老天要下雨，不知何日能出猎，坐吃山空，食物将匮乏，节约渡难关，终于得吉利。
  《象辞》说：鼎耳脱落，意在说其人行动失宜。

- 九四。鼎折足，覆公餗，其形渥，凶。
  象曰：覆公餗，信如何也。
  九四：鼎足太轻，不堪重负，以致折断，倾覆王公的珍馐美味，弄得汁液满地，形容狼藉。这是凶险之兆。
  《象辞》说：倾覆了王公的珍馐美味，这是喻指其人德薄而位尊，力小而任重，以致败坏军国大事，其结果如何呢？

- 六五。鼎黄耳金铉，利贞。
  象曰：鼎黄耳，中以为实也。
  六五：豪华之鼎，上面装配有铜耳、铜铉。筮遇此爻吉利。
  《象辞》说：豪华之鼎，上面装配着铜耳、铜铉，这样的食鼎，理应盛着佳霉美味。

- 上九。鼎玉铉，大吉，无不利。
  象曰：玉铉在上，刚柔节也。
  上九：金属之鼎配以玉石之铉。占得此爻，大吉，无所不利。
  《象辞》说：上九爻辞讲玉石之铉配在金属之鼎上面，表明刚柔相接，上下安份，没有凌乱侵夺的现象。`

const i_101010 = '未济卦\n\
未济。亨，小狐汔济，濡其尾，无攸利。\n\
象曰：火在水上，未济。君子以慎辨物居方。'

const i_101100 = '旅卦\n\
旅。小亨，旅贞吉。\n\
象曰：山上有火，旅。君子以明慎用刑，而不留狱。'

const i_101000 = '晋卦\n\
晋。康侯用锡马蕃庶，昼日三接。\n\
象曰：明出地上，晋。君子以自昭明德。'

const i_001111 = `大壮卦
[卦辞]
大壮。利贞。
象曰：雷在天上，大壮。君子以非礼弗履。

大壮卦：吉利的卜问。
《象辞》说：本卦上卦为震，震为雷，下卦为乾，乾为天，天上鸣雷是大壮的卦象。君子观此卦象，以迅雷可畏，礼法森严，从而畏威知惧，唯礼是遵。

[爻辞]
- 初九。壮于趾，征凶，有孚。
  象曰：壮于趾，其孚穷也。
  初九：伤于脚趾。筮遇此爻，出征则凶，但尚有收获。
  《象辞》说：自恃兵强，侵略他国，虽有收获，但信用扫地。

- 九二。贞吉。
  象曰：九二贞吉，以中也。
  九二：卜问得吉兆。
  《象辞》说：九二爻辞讲贞正吉利，因为九二之爻居下卦中位，像人守中正之道。

- 九三。小人用壮，君子用罔，贞厉。羝羊触藩，羸其角。
  象曰：小人用壮，君子罔也。
  九三：小人捕兽凭气力，君子捕兽靠网围。卜问得险兆。公羊以角撞藩，结果被篱笆卡住。
  《象辞》说：小人捕兽凭气力，君子捕兽靠网围。

- 九四。贞吉，悔亡；藩决不羸，壮于大舆之輹。
  象曰：藩决不羸，尚往也。
  九四：卜问得吉兆，没有悔恨。因为公羊冲决篱笆，摆脱了拘系，但又被车轮撞伤，不能乱冲乱撞了。
  《象辞》说：冲决篱笆，摆脱掏系，恐其冲撞别处。

- 六五。丧羊于易，无悔。
  象曰：丧羊于易，位不当也。
  六五：丧羊于狄。筮遇此爻，没有大的灾祸。
  《象辞》说：丧羊于狄，因为六五阴爻而居处阳位，是所处不当，像人所处环境不适当，将蒙受损失。

- 上六。羝羊触藩，不能退，不能遂，无攸利。艰则吉。
  象曰：不能退，不能遂，不详也；艰则吉，咎不长也。
  上六：羊角插进了篱笆，退不了，进不了，处境不利。但是，目前虽处于艰难之中，最终可以化解逢吉。
  《象辞》说：不能退，不能进，陷入进退维谷之中，这是遭逢不祥。虽陷入艰难之中，最终可以化解逢吉，是说灾难不会长久。`

const i_001011 = `归妹卦
[卦辞]
归妹。征凶，无攸利。
象曰：泽上有雷，归妹。君子以永终知敝。

归妹卦：筮遇此爻，出征凶险。无所利。
《象辞》说：归妹之卦，下卦为兑，兑为泽；上卦为震，震为雷。可见泽上雷鸣，雷鸣水动，用以喻男女心动相爱而成眷属。这是归妹卦的卦象。君子观此卦象，从而在长期的婚姻生活中，体察到婚姻的成功与失败。

[爻辞]
- 初九。归妹以娣，跛能履，征吉。
  象曰：归妹以娣，以恒也。跛能履吉，相承也。
  初九：嫁女而将其妹妹一同陪嫁。跛脚而能行走。筮遇此爻，出行吉利。
  《象辞》说：嫁女而将其妹妹一同陪嫁，是说姊妹共嫁一夫，这是古代贵族婚嫁的常规。跛脚而能行走，出行吉利，因为跛者获得别人的帮助。

- 九二。眇能视，利幽人之贞。
  象曰：利幽人之贞，未变常也。
  九二：眼睛瞎了而能看得见。这是利于囚徒的贞卜。
  《象辞》说：这是利于囚徒的贞卜，因为身处囚笼尚不失正道，故能重见光明。

- 六三。归妹以须，反归以娣。
  象曰：归妹以须，未当也。
  六三：嫁女而用其姊陪嫁，随后又与其妹妹返归父母家。
  《象辞》说：嫁女而用其姊陪嫁，这件事不妥当。

- 九四。归妹愆期，迟归有时。
  象曰：愆期之志，有待而行也。
  九四：出嫁时超过了婚龄，迟迟不嫁是因为有所等待。
  《象辞》说：超龄而不嫁，因为她决意找到合意的郎君。

- 六五。帝乙归妹，其君之袂，不如其娣之袂良。月几望，吉。
  象曰：帝乙归妹，不如其娣之袂良也。其位在中，以贵行也。
  六五：帝乙嫁女于周文王，以其次女陪嫁。论嫁妆姊的不如妹的好。良辰择在某月十四日，吉利。
  《象辞》说：帝乙嫁女于周文王，姊的嫁妆不如妹的好。六五之爻居上卦中位，像女嫁夫家处于尊贵之位。

- 上六。女承筐无实，士刲羊无血，无攸利。
  象曰：上六无实，承虚筐也。
  上六：献祭之时，新娘捧着盛祭品的筐具，但筐中无物；新郎以刀刺羊，但羊不流血。此不祥之兆，无所利。
  《象辞》说：上六之爻居一卦之尽头，孤悬无所依赖，正宜其捧着空空的筐具。`

const i_001101 = '丰卦\n\
丰。亨。王假之，勿忧，宜日中。\n\
象曰：雷电皆至，丰。君子以折狱致刑。'

const i_001001 = `震卦
[卦辞]
震。亨。震来虩虩，笑言哑哑。震惊百里，不丧匕鬯。
象曰：洊雷，震。君子以恐惧修省。

震卦：临祭之时，雷声传来，有的人吓得浑身发抖，片刻之后，才能谈笑如常。巨雷猝响，震惊百里，有的人却神态自若，手里拿着酒勺子，连一滴酒都没有洒出来。
《象辞》说：本卦上下卦都为震，震为雷。可见巨雷连击，是震卦的卦象。君子观此卦象，从而戒惧恐惧，修省其身。

[爻辞]
- 初九。震来虩虩，后笑言哑哑，吉。
  象曰：震来虩虩，恐致福也。笑言哑哑，后有则也。
  初九：雷声传来，吓得浑身发抖，后来听到雷声，仍谈笑如常，吉利。
  《象辞》说：雷声传来，吓得浑身发抖，是因为相信敬畏重大的天象可以免罪得福。后来听到雷声仍能谈笑如常，是说后来对这类事情有了些经验。

- 六二。震来厉，亿丧贝。跻于九陵，勿逐，七日得。
  象曰：震来厉，乘刚也。
  六二：雷电交加，十分危险，惊慌之中丢失了钱币，翻山越蛉，走了很远的路程去寻找也没有找到。筮者告诉他：“不必追寻了，七八日内，这损失可得补偿。”
  《象辞》说：雷电交加之时，翻越九重山，爻象显示其人触犯雷电，处境危险。

- 六三。震苏苏，震行无眚。
  象曰：震苏苏，位不当也。
  六三：出门时遇到电闪雷鸣，感到疑惧不安。继续前进，不会有灾祸。
  《象辞》说：出门时遇到电闪雷鸣，感到疑惧不安，因为六三阴爻而居阳位，像人处境不利。

- 九四。震遂泥。
  象曰：震遂泥，未光也。
  九四：雷电下击，接触到地面。
  《象辞》说：其人猝闻惊雷，吓得坠入泥中，说明其人见识不广，胆量不大。

- 六五。震往来厉，亿无丧，有事。
  象曰：震往来厉，危行也。其事在中，大无丧也。
  六五：巨雷轰鸣，危险在前。只要小心谨慎，不至于酿成灾祸，亦无损于事。
  《象辞》说：巨雷轰鸣，危险在前，喻指人的行动将有危险。但是其事合符义理，故能没有大的损失。

- 上六。震索索，视矍矍，征凶。震不于其躬，于其邻，无咎。婚媾有言。
  象曰：震索索，未得中也。虽凶无咎，畏邻戒也。
  上六：雷电交加，其人行动谨慎，警戒四顾，因为行路艰难，危险四伏。但是雷电不会击在他身上，而是落在邻人的头上。因为他本人没有什么过错，而其他邻人却犯有罪责。
  《象辞》说：雷电交加，行动谨慎，因为内心虚空，精神紧张。虽然凶险但毕竟没有灾祸，因为对于邻人的遭遇有所警戒，从而能远恶近善。`

const i_001110 = `恒卦
[卦辞]
恒。亨，无咎，利贞。利有攸往。
象曰：雷风，恒。君子以立不易方。

恒卦：通达，没有过失，吉利的卜问。有所往则有利。
《象辞》说：本卦上卦为震，震为雷，下卦为巽，巽为风，风雷荡涤，宇宙常新，这是恒卦的卦象。君子观此卦象，从而立于正道，坚守不易。

[爻辞]
- 初六。浚恒，贞凶，无攸利。
  象曰：浚恒之凶，始求深也。
  初六：掘进不止，卜问凶险，没有什么好处。
  《象辞》说：掘进不止之所以凶险，因为冒险求深，必遭崩塌之祸。

- 九二。悔亡。
  象曰：九二悔亡，能久中也。
  九二：没有悔恨。
  《象辞》说：九二爻辞说没有悔恨，因为能坚守中正之道。

- 九三。不恒其德，或承之羞，贞吝。
  象曰：不恒其德，无所容也。
  九三：不能保持其德行，必然蒙受耻辱。卜问得艰难之兆。
  《象辞》说：不能保持其德行，反复无常，无人信任，必然落到无所容身的地步。

- 九四。田无禽。
  象曰：久非其位，安得禽也。
  九四：畋猎无所获。
  《象辞》说：长久处于不适宜的环境，怎会有收获？

- 六五。恒其德，贞。妇人吉，夫子凶。
  象曰：妇人贞吉，从一而终也。夫子制义，从妇凶也。
  六五：操行一贯。卜得妇人吉利，丈夫凶险。
  《象辞》说：爻辞讲妇人操守贞洁则吉利，这是符合从夫以终其身的道理。丈夫则因事制义，其道多方，如果以妇德来约束男子，则必遭凶险。

- 上六。振恒，凶。
  象曰：振恒在上，大无功也。
  上六：久动不息，凶险。
  《象辞》说：统治者朝令夕改，政令无常，其结果必所向无功。`

const i_001010 = '解卦\n\
解。利西南。无所往，其来复吉。有攸往，夙吉。\n\
象曰：雷雨作，解。君子以赦过宥罪。'

const i_001100 = '小过卦\n\
小过。亨，利贞。可小事，不可大事。飞鸟遗之音。不宜上，宜下，大吉。\n\
象曰：山上有雷，小过。君子以行过乎恭，丧过乎衰，用过乎俭。'

const i_001000 = '豫卦\n\
豫。利建侯行师。\n\
象曰：雷出地奋，豫。先王以作乐崇德，殷荐之上帝，以配祖考。'

const i_110111 = '小畜卦\n\
小畜。亨。密云不雨，自我西郊。\n\
象曰：风行天上，小畜。君子以懿文德。'

const i_110011 = `中孚卦
[卦辞]
中孚。豚鱼，吉。利涉大川，利贞。
象曰：泽上有风，中孚。君子以议狱缓死。

中孚卦：豚鱼献祭，虽物薄但心诚，吉利。并利于涉水过河。这是吉利的贞卜。
《象辞》说：本卦上卦为巽，巽为风；下卦为兑，兑为泽，泽上有风，风起波涌。这是中孚的卦象。君子观此卦象，有感于风化邦国，唯德教为先，因而审议讼狱，不轻置重典。

[爻辞]
- 初九。虞吉，有它不燕。
  象曰：初九虞吉，志未变也。
  初九：行安神之礼，吉利。有这样的变故，自然不行讌礼。
  《象辞》说：初九爻辞讲行安神之礼，吉利，因为慕恋先人的心愿未变。

- 九二。鸣鹤在阴，其子和之。我有好爵，吾与尔靡之。
  象曰：其子和之，中心愿也。
  九二：老鹤在树荫下鸣叫，小鹤在旁边附和。我有美酒，与你共享用。
  《象辞》说：小鹤和应老鹤，这是心灵相通的表现。

- 六三。得敌，或鼓或罢，或泣或歌。
  象曰：或鼓或罢，位不当也。
  六三：击败了敌人，有的击鼓追击，有的凯旋报捷；消息传来，有的高兴得热泪盈眶，有的放声高歌。
  《象辞》说：有的人击鼓追击，有的凯旋报捷，但从爻象看来，六三阴爻而处于阳位，胜利之中，恐怕隐伏着不测之祸。

- 六四。月既望，马匹亡，无咎。
  象曰：马匹亡，绝类上也。
  六四：月中的时候，马匹丢失了，但无大的灾祸。
  《象辞》说：马匹丢失了，此后要加倍警惕，防止再发生类似事情。

- 九五。有孚挛如，无咎。
  象曰：有孚挛如，位正当也。
  九五：俘虏成群，串连捆绑。没有灾难。
  《象辞》说：存心诚信，始终如一，正如九五爻象所显示的，其人行事与其地位相合。

- 上九。翰音登于天，贞凶。
  象曰：翰音登于天，何可长也。
  上九：鸡飞到天空。卜问得凶兆。
  《象辞》说：鸡飞到天空，它怎能长久飞翔呢？`

const i_110101 = '家人卦\n\
家人。利女贞。\n\
象曰：风自火出，家人。君子以言有物，而行有恒。'

const i_110001 = '益卦\n\
益。利有攸往，利涉大川。\n\
象曰：风雷，益。君子以见善则迁，有过则改。'

const i_110110 = `巽卦
[卦辞]
巽。小亨。利有攸往，利见大人。
象曰：随风，巽。君子以申命行事。

[爻辞]
初六。进退，利武人之贞。
象曰：进退，志疑也。利武人之贞，志治也。
初六：进退听命，这是利于武人的占卜。
《象辞》说：进退听命，是因为自己没有成见。武人具有坚定的意志是应该的，因为只有意志坚定，才能勇敢无畏，临危不乱。

九二。巽在床下，用史巫纷若，吉，无咎。
象曰：纷若之吉，得中也。
九二：病人卧床不起，祝史巫士降神祭祀，禳灾驱鬼，忙碌不停。病情有好转，灾难消除了。
《象辞》说：祝史巫士禳灾驱鬼忙碌不停，之所以使病情有好转，因为九二阳爻居下卦中位，爻象既得，灾难自退。

九三。频巽，吝。
象曰：频巽之吝，志穷也。
九三：勉强顺从，其心必不顺畅。
《象辞》说：勉强顺从，而内心不顺畅，说明这是出于无可奈何。

六四。悔亡，田获三品。
象曰：田获三品，有功也。
六四：没有悔恨，狩猎获得各种猎物。
《象辞》说：狩猎获得各种猎物，说明狩猎大有收获。

九五。贞吉，悔亡，无不利。无初有终。先庚三日，后庚三日，吉。
象曰：九五之吉，位中正也。
九五：贞卜得吉兆，没有悔恨，无所不利。虽没有良好的开端，但有良好的结局。时日定在丁日或癸日，其事一定成功。
《象辞》说：九五爻辞之所以讲吉利，因为九五阳爻居上卦中位，像人事合于正道，自然吉利。

上九。巽在床下，丧其资斧，贞凶。
象曰：巽在床下，上穷也；丧其资斧，正乎凶也。
上九：人隐伏在床底下，钱财则被洗劫一空。卜问得凶兆。
《象辞》说：隐伏在床底下，正是上九阳爻穷途末路之象。钱财被洗劫，不正是凶险之事吗？`

const i_110010 = `涣卦
[卦辞]
涣。亨，王假有庙。利涉大川，利贞。
象曰：风行水上，涣。先王以享于帝，立庙。

涣卦：亨通，因为君王亲临宗庙，禳灾祈福。利于涉水过江河。这是吉利的贞卜
《象辞》说：本卦上卦为巽，巽为风；下卦为坎，坎为水。风行水上，是涣卦的卦象。先王观此卦象，从而享祭天帝，建立宗庙，推行尊天孝祖的“德教”。

[爻辞]
- 初六。用拯马壮，吉。
  象曰：初六之吉，顺也。
  初六：洪水突来，因而乘马逃避，匆促跌伤，幸免淹亡之祸，吉利。
  《象辞》说：初六爻辞讲的吉利，是因为初六阴爻居九二阳爻之下，有阴柔顺从阳刚之意。像马顺从人意。

- 九二。涣奔其机，悔亡。
  象曰：涣奔其机，得愿也。
  九二：洪水奔涌，冲毁房基。性命无虞。不幸中之万幸。
  《象辞》说：荡涤冲刷其污垢，正是心中所愿。

- 六三。涣其躬，无悔。
  象曰：涣其躬，志在外也。
  六三：洪水冲到身上，幸免于难，尚可庆幸。
  《象辞》说：冲刷他的身体，说明其人志在教育他人，治理国家。

- 六四。涣其群，元吉。涣有丘，匪夷所思。
  象曰：涣其群，元吉，光大也。
  六四：洪水冲向人群，然而十分幸运，因为人群聚集在山丘上，洪水只能淹到山脚，否则其后果是平常难以想像的。
  《象辞》说：冲刷大众百姓，说明君王德教广施，教化大行。

- 九五。涣汗其大号，涣王居，无咎。
  象曰：王居无咎，正位也。
  九五：洪水横溢，淹没国都，淹及王宫，牵好人员早巳撤走，没有大的灾难。
  《象辞》说：王宫没有遭遇灾难，因为九五阳爻居上卦中位，位尊且正，自然无灾难。

- 上九。涣其血，去逖出，无咎。
  象曰：涣其血，远害也。
  上九：洪水退去，忧患消除，但仍须警惕，加强防范，这样就没有灾难。
  《象辞》说：有血光之灾，走开，远远地走开，这样就可远离灾害。`

const i_110100 = '渐卦\n\
渐。女归吉，利贞。\n\
象曰：山上有木，渐。君子以居贤德善俗。'

const i_110000 = '观卦\n\
观。盥而不荐，有孚顒若。\n\
象曰：风行地上，观。先王以省方，观民设教。'

const i_010111 = '需卦\n\
需。有孚，光亨，贞吉。利涉大川。\n\
象曰：云上于天，需；君子以饮食宴乐。'

const i_010011 = '节卦\n\
节。亨，苦节不可贞。\n\
象曰：泽上有水，节。君子以制数度，议德行。'

const i_010101 = '既济卦\n\
既济。亨，小利贞，初吉终乱。\n\
象曰：水在火上，既济。君子以思患而预防之。'

const i_010001 = '屯卦\n\
屯。元，亨，利，贞。勿用，有攸往，利建侯。\n\
象曰：云，雷，屯；君子以经纶。'

const i_010110 = '井卦\n\
井。改邑不改井，无丧无得。往来井井。汔至，亦未繘井，羸其瓶，凶。\n\
象曰：木上有水，井。君子以劳民劝相。'

const i_010010 = '坎卦\n\
坎。习坎，有孚，维心亨，行有尚。\n\
象曰：水洊至，习坎。君子以常德行，习教事。'

const i_010100 = '蹇卦\n\
蹇。利西南，不利东北。利见大人，贞吉。\n\
象曰：山上有水，蹇。君子以反身修德。'

const i_010000 = '比卦\n\
比。吉。原筮，元永贞，无咎。不宁方来，后夫凶。\n\
象曰：地上有水，比。先王以建万国，亲诸侯。'

const i_100111 = '大畜卦\n\
大畜。利贞，不家食，吉。利涉大川。\n\
象曰：天在山中，大畜。君子以多识前言往行，以畜其德。'

const i_100011 = '损卦\n\
损。有孚，元吉，无咎，可贞。利有攸往。曷之用？二簋可用享。\n\
象曰：山下有泽，损。君子以征忿窒欲。'

const i_100101 = '贲卦\n\
贲。亨。小利有攸往。\n\
象曰：山下有火，贲。君子以明庶政，无敢折狱。'

const i_100001 = `颐卦
[卦辞]
颐。贞吉。观颐，自求口实。
象曰：山下有雷，颐。君子以慎言语，节饮食。

颐卦：占卜得吉兆。研究颐养之道，在于自食其力。
《象辞》说：本卦上卦为艮为山，下卦为震为雷，雷出山中，万物萌发，这是颐卦的卦象。君子观此卦象，思生养之不易，从而谨慎言语，避免灾祸。节制饮食，修身养性。

[爻辞]
- 初九。舍尔灵龟，观我朵颐，凶。
  象曰：观我朵颐，亦不足贵也。
  初九：自己储藏着大量的财宝，还要羡嫉人家的财物，必遭凶险之事。
  《象辞》说：羡嫉人家的财物，这不是高尚的行为。

- 六二。颠颐，拂经；于丘颐，征凶。
  象曰：六二征凶，行失类也。
  六二：为了糊口，就得在山坡上开荒种地。为了生计而去抢劫别人，这是凶险之事。
  《象辞》说：六二爻辞说抢劫则凶，因为这种行径违反道义。

- 六三。拂颐，贞凶。十年勿用，无攸利。
  象曰：十年勿用，道大悖也。
  六三：违背养生正道，靠歪门邪道过活，占问得凶兆。十年都得倒霉，永无好处。
  《象辞》说：十年都得倒霉，因为这种行为大有悖于道义。

- 六四。颠颐，吉。虎视眈眈，其欲逐逐，无咎。
  象曰：颠颐之吉，上施光也。
  六四：所求不过糊口，害人之心不可存，吉利。虎视眈眈，防人之心不可无。这样就可以安享天年，悠然自得，无灾祸。
  《象辞》：所求不过餬口，之所以吉利，因为君上施舍甚广，足以养民。

- 六五。拂经，居贞吉。不可涉大川。
  象曰：居贞之吉，顺以从上也。
  六五：开荒种地，平居度日，占问得吉兆。筮遇此爻，不可涉水渡河。
  《象辞》说：平居守正，之所以吉利，因为其人安份循道，服从君上。

- 上九。由颐，厉吉。利涉大川。
  象曰：由颐厉吉，大有庆也。
  上九：遵循生活正道，先艰难而终吉利。筮遇此爻，有利于涉水渡河。
  《象辞》说：遵循生活正道，先艰难而终吉利，因为善良之人终得善报。`

const i_100110 = '蛊卦\n\
蛊。元亨，利涉大川。先甲三日，后甲三日。\n\
象曰：山下有风，蛊。君子以振民育德。'

const i_100010 = '蒙卦\n\
蒙。亨。匪我求童蒙，童蒙求我。初筮告，再三渎，渎则不告。利贞。\n\
象曰：山下出泉，蒙。君子以果行育德。'

const i_100100 = '艮卦\n\
艮。艮其背，不获其身。行其庭，不见其人。无咎。\n\
象曰：兼山，艮。君子以思不出其位。'

const i_100000 = '剥卦\n\
剥。不利有攸往。\n\
象曰：山附于地，剥。上以厚下，安宅。'

const i_000111 = '泰卦\n\
泰。小往大来，吉亨。\n\
象曰：天地交，泰。后以财（裁）成天地之道，辅相天地之宜，以左右民。'

const i_000011 = '临卦\n\
临。元，亨，利，贞。至于八月有凶。\n\
象曰：泽上有地，临。君子以教思无穷，客保民无疆。'

const i_000101 = '明夷卦\n\
明夷。利艰贞。\n\
象曰：明入地中，明夷。君子以莅众，用晦而明。'

const i_000001 = '复卦\n\
复。亨。出入无疾，朋来无咎。反复其道，七日来复，利有攸往。\n\
象曰：雷在地中，复。先王以至日闭关，商旅不行，后不省方。'

const i_000110 = '升卦\n\
升。元亨。用见大人，勿恤，南征吉。\n\
象曰：地中生木，升。君子以顺德，积小以高大。'

const i_000010 = '师卦\n\
师。贞，丈人吉，无咎。\n\
象曰：地中有水，师。君子以容民畜众。'

const i_000100 = '谦卦\n\
谦。亨，君子有终。\n\
象曰：地中有山，谦。君子以裒多益寡，称物平施。'

const i_000000 = `坤卦
[卦辞]
坤。元，亨，利牝马之贞。君子有攸往，先迷后得主。利西南得朋，东北丧朋。安贞，吉。\n\
象曰：地势坤，君子以厚德载物。

坤卦：大吉大利。占问雌马得到吉兆。君子前去旅行，先迷失路途，后来找到主人，吉利。西南行获得财物，东北行丧失财物。占问定居，得到吉兆。
《象辞》说：大地的形势平铺舒展，顺承天道。君子观此卦象，取法于地，以深厚的德行来承担重大的责任。

[爻辞]
- 初六。履霜，坚冰至。
  象曰：履霜坚冰，阴始凝也。驯致其道，至坚冰也。
  初六：践踏着薄霜，可以推断坚厚的冰层快要冻结成了。
  《象辞》说：践踏着薄霜，可以推断坚厚的冰层快要冻结成了。这表明阴冷之气开始凝聚了，遵循自然规律的推进，坚厚的冰层快要冻结而成了。

- 六二。直，方，大，不习无不利。
  象曰：六二之动，直以方也；不习无不利，地道光也。
  六二：平直、方正、辽阔是大地的特点。即使前往陌生的地方，也没有什么不利的。
  《象辞》说：六二的爻象是平直而且方正，即使前往陌生的地方，也没有什么不利的，因为地道是广大无边的。

- 六三。含章可贞。或从王事，无成有终。
  象曰：含章可贞，以时发也；或从王事，知光大也。
  六三：战胜殷商。称心的占卜。有人服役于战争，没有取得战绩，但结局还是好的。
  《象辞》说：战胜殷商，称心的占卜，说明能抓住时机采取行动。有人服役于战争（没有取得战绩而有好的结局），因为他才智广大。

- 六四。括囊，无咎，无誉。
  象曰：括囊无咎，慎不害也。
  六四：扎紧了口袋，如缄口不言，没有指责，也没有赞誉。
  《象辞》说：扎紧了口袋，如缄口不言，是说谨慎才没有祸害。

- 六五。黄裳，元吉。
  象曰：黄裳元吉，文在中也。
  六五：黄色的裙裤，大吉大利。
  《象辞》说：黄色的裙裤大吉大利，因为“黄裳”象征着人内在的美德。

- 上六。龙战于野，其血玄黄。
  象曰：龙战于野，其道穷也。
  上六：龙在大地上争斗，血流遍野。
  《象辞》说：龙在大地上争斗，比喻人走到了穷困的绝境。`

export const AllGua = new Map([
  ['111111', i_111111],
  ['111011', i_111011],
  ['111101', i_111101],
  ['111001', i_111001],
  ['111110', i_111110],
  ['111010', i_111010],
  ['111100', i_111100],
  ['111000', i_111000],
  ['011111', i_011111],
  ['011011', i_011011],
  ['011101', i_011101],
  ['011001', i_011001],
  ['011110', i_011110],
  ['011010', i_011010],
  ['011100', i_011100],
  ['011000', i_011000],
  ['101111', i_101111],
  ['101011', i_101011],
  ['101101', i_101101],
  ['101001', i_101001],
  ['101110', i_101110],
  ['101010', i_101010],
  ['101100', i_101100],
  ['101000', i_101000],
  ['001111', i_001111],
  ['001011', i_001011],
  ['001101', i_001101],
  ['001001', i_001001],
  ['001110', i_001110],
  ['001010', i_001010],
  ['001100', i_001100],
  ['001000', i_001000],
  ['110111', i_110111],
  ['110011', i_110011],
  ['110101', i_110101],
  ['110001', i_110001],
  ['110110', i_110110],
  ['110010', i_110010],
  ['110100', i_110100],
  ['110000', i_110000],
  ['010111', i_010111],
  ['010011', i_010011],
  ['010101', i_010101],
  ['010001', i_010001],
  ['010110', i_010110],
  ['010010', i_010010],
  ['010100', i_010100],
  ['010000', i_010000],
  ['100111', i_100111],
  ['100011', i_100011],
  ['100101', i_100101],
  ['100001', i_100001],
  ['100110', i_100110],
  ['100010', i_100010],
  ['100100', i_100100],
  ['100000', i_100000],
  ['000111', i_000111],
  ['000011', i_000011],
  ['000101', i_000101],
  ['000001', i_000001],
  ['000110', i_000110],
  ['000010', i_000010],
  ['000100', i_000100],
  ['000000', i_000000]
]);


export const ZiweiMain = [
  "紫微星",
  "天府星",
  "天相星",
  "天梁星",
  "七杀星",
  "破军星",
  "贪狼星",
  "巨门星",
  "廉贞星",
  "太阳星",
  "太阴星",
  "天同星",
  "天机星",
  "武曲星",
  "紫微七杀",
  "紫微破军",
  "紫微贪狼",
  "紫微天府",
  "紫微天相",
  "廉贞七杀",
  "廉贞破军",
  "廉贞贪狼",
  "廉贞天府",
  "廉贞天相",
  "武曲七杀",
  "武曲破军",
  "武曲天府",
  "武曲贪狼",
  "武曲天府",
  "武曲天相",
  "天机巨门",
  "天机太阴",
  "天机天梁",
  "巨门天同",
  "巨门太阳",
  "太阳太阴",
  "太阳天梁",
  "太阴天同",
  "天同天梁",
  "空宫牌"
]

export const ZiweiSub = [
  "擎羊",
  "火星",
  "陀罗",
  "铃星",
  "天刑",
  "阴煞",
  "地空",
  "地劫",
  "文昌",
  "文曲",
  "左辅",
  "右弼",
  "天魁",
  "天钺",
  "红鸾天喜",
  "禄存",
  "化禄",
  "化权",
  "化科",
  "化忌"
]

export const ZiweiTwelvePhase = [
  "长生",
  "沐浴",
  "冠带",
  "临官",
  "帝旺",
  "衰",
  "病",
  "死",
  "墓",
  "绝",
  "胎",
  "养"
]
